spec/fixtures/vcr/Jackpot_Gateway/_process_payment/raises_error_when_not_authorized.yml

---
http_interactions:
- request:
    method: post
    uri: https://secure.braintreepaymentgateway.com/api/transact.php
    body:
      encoding: US-ASCII
      string: username=demo&password=password&type=auth&orderid=&customer_vault_id=456&currency=USD&tax=&amount=0.10
    headers:
      content-type:
      - application/x-www-form-urlencoded
      accept:
      - ! '*/*'
      user-agent:
      - Ruby
      connection:
      - close
  response:
    status:
      code: 200
      message: OK
    headers:
      date:
      - Tue, 24 Apr 2012 14:53:21 GMT
      server:
      - Apache
      content-length:
      - '203'
      connection:
      - close
      content-type:
      - text/html
    body:
      encoding: US-ASCII
      string: response=2&responsetext=DECLINE&authcode=&transactionid=1605424325&avsresponse=&cvvresponse=&orderid=&type=auth&response_code=200&merchant_defined_field_6=&merchant_defined_field_7=&customer_vault_id=456
    http_version: '1.1'
  recorded_at: Tue, 24 Apr 2012 14:53:23 GMT
recorded_with: VCR 2.0.1
